STL_IGU_55_N6_AER4/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;//JN: "LEGO" mesh
snap            true;//JN: real mesh
addLayers       false;//JN: layers, we will not use this in this tutorial


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    inlet1.stl//JN: name of the stl file
    {
        type triSurfaceMesh;
        scale 0.001;
        name inlet1;//JN: name we will use in this dictionary

    }
    inlet2.stl//JN: name of the stl file
    {
        type triSurfaceMesh;
        scale 0.001;
        name inlet2;//JN: name we will use in this dictionary
    }
    outlet.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name outlet;
    }
    windowsmall.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name windowsmall;
    }
    door.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name door;
    }
    columns.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name columns;
    }
    windowbig.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name windowbig;
    }
    ceiling.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name ceiling;
    }
    floor.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name floor;
    }
    wallwindow.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name wallwindow;
    }
    walldoor.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name walldoor;
    }
    walloutside.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name walloutside;
    }
    wallinside.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name wallinside;
    }
    emission_surface.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name emission_surface;
    }
    n_001.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name n_001;
    }
    n_002.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name n_002;
    }
    n_003.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name n_003;
    }
    n_004.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name n_004;
    }
    n_005.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name n_005;
    }
    n_006.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name n_006;
    }
};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 20000;//JN: for parallel meshing

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 200000;//JN: maximum number of cells - guiding value, can be exceeded

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 1;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 1;//JN: number of cells between refinement levels



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
          file "inlet1.eMesh";
          level 0;
      }
      {
          file "inlet2.eMesh";
          level 0;
      }
      {
          file "outlet.eMesh";
          level 0;
      }
      {
          file "windowsmall.eMesh";
          level 0;
      }
      {
          file "door.eMesh";
          level 0;
      }
      {
          file "columns.eMesh";
          level 0;
      }
      {
          file "windowbig.eMesh";
          level 0;
      }
      {
          file "ceiling.eMesh";
          level 0;
      }
      {
          file "floor.eMesh";
          level 0;
      }
      {
          file "wallwindow.eMesh";
          level 0;
      }
      {
          file "walldoor.eMesh";
          level 0;
      }
      {
          file "walloutside.eMesh";
          level 0;
      }
      {
          file "wallinside.eMesh";
          level 0;
      }
      {
          file "emission_surface.eMesh";
          level 0;
      }
      {
          file "n_001.eMesh";
          level 6;
      }
      {
          file "n_002.eMesh";
          level 6;
      }
      {
          file "n_003.eMesh";
          level 6;
      }
      {
          file "n_004.eMesh";
          level 6;
      }
      {
          file "n_005.eMesh";
          level 6;
      }
      {
          file "n_006.eMesh";
          level 6;
      }
    );




    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.
    refinementSurfaces
    {
        inlet1
        {
            // Surface-wise min and max refinement level
            level (0 0);//JN: refinement defined by surfaces - i.e. stl surfaces
        }
        inlet2
        {
            // Surface-wise min and max refinement level
            level (0 0);//JN: refinement defined by surfaces - i.e. stl surfaces
        }
	      outlet
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
	      windowsmall
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
      	door
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        columns
        {
            // Surface-wise min and max refinement level
            level (2 6);
        }
        windowbig
        {
            // Surface-wise min and max refinement level
            level (2 6);
        }
        ceiling
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        floor
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        wallwindow
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        walldoor
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        walloutside
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        wallinside
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        emission_surface
        {
            // Surface-wise min and max refinement level
            level (0 0);
        }
        n_001
        {
            // Surface-wise min and max refinement level
            level (6 7);
        }
        n_002
        {
            // Surface-wise min and max refinement level
            level (6 7);
        }
        n_003
        {
            // Surface-wise min and max refinement level
            level (6 7);
        }
        n_004
        {
            // Surface-wise min and max refinement level
            level (6 7);
        }
        n_005
        {
            // Surface-wise min and max refinement level
            level (6 7);
        }
        n_006
        {
            // Surface-wise min and max refinement level
            level (6 7);
        }
    }

    resolveFeatureAngle 3;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
	//JN: here we could additionally refine the mesh
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    // This is an outside point locationInMesh (-0.033 -0.033 0.0033);
    locationInMesh (0 0 1); //JN: point inside our geometry

    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
//JN: Mostly standard settings
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 5;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 0.5;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 300;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 8;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric) features by sampling the surface
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features
        explicitFeatureSnap true;

        //- Detect features between multiple surfaces
        //  (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap true;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        "(.*let.*)"
        {
            nSurfaceLayers 1;
        }
        "n_00*.*"
        {
            nSurfaceLayers 1;
        }
    }

    // Expansion factor for layer mesh
    expansionRatio 2.0;


    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.3;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // See relativeSizes parameter.
    minThickness 0.25;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    nGrow 0;


    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 3;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    minMedianAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;

    // Max number of iterations after which relaxed meshQuality controls
    // get used. Up to nRelaxIter it uses the settings in meshQualityControls,
    // after nRelaxIter it uses the values in meshQualityControls::relaxed.
    nRelaxedIter 20;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    maxNonOrtho     35;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-15;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;

    // Optional : some meshing phases allow usage of relaxed rules.
    // See e.g. addLayersControls::nRelaxedIter.
    relaxed
    {
        //- Maximum non-orthogonality allowed. Set to 180 to disable.
        maxNonOrtho 25;
    }

    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- Amount to scale back displacement at error points
    errorReduction 0.75;
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1E-8;


// ************************************************************************* //
