STL_IGU_55_N6_AER4/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  P1
solverFreq 10;

absorptionEmissionModel constant;

constantCoeffs
{
   absorptivity    0.5;
   emissivity      0.5;
   E               0;
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
